["\n    On the DVD commentary track, the actors and actresses note that Tim Curry's characterization of Pennywise was so creepy and realistic that everyone avoided him during the filming.  ", "\nJarred Blancard (young Henry Bowers) hated having to call Marlon Taylor (young Mike Hanlon) a \"ni--er\" and would often apologize to him before and after filming for his character's use of the slur.  ", "\nTim Curry was reluctant to take the role of Pennywise initially, because he didn't relish the thought of being buried under so much make-up. When he played Darkness in Legend (1985), it was a difficult and demanding role, and the hours in make-up was still fresh in his mind. To compromise, Writer and Director Tommy Lee Wallace minimized the amount of make-up on Curry, and a lot wasn't necessary anyway because Curry's performance was so strong.  ", "\n    Writer and Director Tommy Lee Wallace felt that It: Part 2 (1990) wasn't as good as It: Part 1 (1990), because the adults weren't as magnetic to watch, especially when it came time to battle Pennywise.  ", "\n    On the day the kids go into the sewers, it was raining, saving the production crew the trouble of having to fake it.  ", "\n    The weird furniture in Stan's house was meant to signify that something is \"off\" in Stan's life.  ", "\n    A lot of Eddie's medicines in this mini-series belonged to Dennis Christopher. In fact, Writer and Director Tommy Lee Wallace allowed the actors and actresses to bring things from their normal lives on-set.  ", "\n    In this mini-series, the words \"Beep beep, Richie\" are often used. In the novel, it is explained that this phrase is meant to get Richie to shut up.  ", "\nJohn Ritter retained one of the playing cards with Pennywise's face on it after filming wrapped.  ", "\n    All of the cast have fond memories of working on this mini-series, saying it was one of the best experiences of their lives on the DVD commentary. This was mirrored twenty-seven years later, when all of the kids who worked on It (2017) called the three-month shoot the best summer of their lives, and claimed that they were all best friends on-screen and in real-life.  ", "\n    In the novel, Beverly makes love to all of \"The Lucky Seven\", but Tommy Lee Wallace omitted it from this mini-series because it was just something that didn't ring true to him.  ", "\n    The scenes in the sewer were filmed in a steel mill.  ", "\n    The gray in Mike's hair was achieved by brushing in baby powder with a toothbrush.  ", "\n    The ending of the novel included the appearance of the Turtle, which was It's natural enemy and created the universe. When John Ritter asked about the Turtle's appearance in this mini-series, the studio asked if he was crazy.  ", "\nAlice Cooper was considered for the role of Pennywise.  ", "\n    Since It first aired, there has been a lot of speculation about the sewer building pump house. Fans wanted to know the location of the real building, and rumor was that it was a built set that was immediately torn down after filming. The real building is the old Buntzen Lake Hydro Plant in Canada, which looked vaguely different in 1990, but after it shut down in the early 2000s, it now retains a more faded look. People can go up to it, but are prohibited from going inside without authorization.  ", "\nIt: Part 1 (1990) was the fifth highest rated program on Sunday, November 18, 1990, with an 18.5 rating and watched in 17.5 million households. It: Part 2 (1990) was the second highest rated program on Tuesday, November 20, 1990, with a 20.6 rating and watched in 19.2 million households.  ", "\nHarry Anderson improvised a lot of Richie's one-liners.  ", "\nJonathan Brandis and John Ritter died in 2003. Brandis hung himself, while Ritter suffered an unexpected, fatal aortic dissection.  ", "\nTommy Lee Wallace is a former protégé of John Carpenter. This mini-series paid homage to Carpenter movies like The Fog (1980) and Halloween (1978).  ", "\n    The theater scenes racked up many dull hours of waiting and retakes for the child extras. Tim Curry often came onto the stage in full costume and conducted singalongs with the extras, most of whom didn't know who he was. They thought he was actually a clown hired to entertain them.  ", "\n    The adult actors and actresses had to be careful what they touched during the sewer scenes because the place was so rusty, there was a very real danger of tetanus infection. Because of that, it was not a fun scene to film.  ", "\n    Most of Stephen King's books take place in the Bangor, Maine area, and in a fictionalized town. The book was written and finished in the real Bangor.  ", "\nStephen King stated in a 2013 interview that he came up with the idea for Pennywise after asking himself what scared children \"more than anything else in the world.\" He felt that the answer was clowns. King also thought of a troll like the one in the children's tale \"Three Billy Goats Gruff\", but a troll who inhabited a sewer system.  ", "\n    Writer and Director Tommy Lee Wallace admitted he had never read the novel before making this mini-series. He preferred to let the script speak for itself. In the DVD Commentary, Wallace revealed that he read the novel later on and admitted that he believes the mini-series fell short of the source material.  ", "\nStephen King allowed a lot of flexibility when it came to re-writing much of the novel.  ", "\nStephen King's novel \"IT\" is connected to his \"The Dark Tower\" series. The novel has an image of a turtle supporting the Earth. A poem explaining this, \"See the Turtle of enormous girth/ Upon his back he holds the Earth\", appeared in \"IT\" and \"The Dark Tower III: The Waste Lands\". That book also expanded on the idea of multiple dimensions, each guarded by an animal avatar, held together by The Dark Tower in the center, rather like the spokes of a wheel. \"The Dark Tower VII: The Dark Tower\" featured a character named Mordred, who, like Pennywise, shifts from human to spider form, and another character, Dandelo, who, like Pennywise, has \"deadlights\" behind his eyes that will drive a mortal to madness. Stephen King stated that Dandelo is not Pennywise, but that the two may be the same species (in the novel, Pennywise is revealed to be a pregnant female, therefore opening up the possibility for multiple Its) The character Mike Hanlon appeared in \"IT\" and \"Insomnia\", which introduced Dark Tower character Patrick Danville.  ", "\nTommy Lee Wallace's first mini-series. Because it was his first, he tried to get it as close to perfect as possible. However, he later said he believed they fell short in comparison to Stephen King's original novel.  ", "\nTim Curry had the earliest call times, before any of the other actors, because of the long hours he needed to spend in make-up.  ", "\n    In the novel, Eddie Kaspbrak lives with his wife Myra, not his mother.  ", "\nRoddy McDowall and Malcolm McDowell were originally considered for the role of Pennywise.  ", "\n    When ABC and Lorimar first announced this mini-series, it was to be a ten-hour mini-series directed by George A. Romero. Romero did extensive pre-production work and closely collaborated with Lawrence D. Cohen to develop the script, but he had to bow out due to a scheduling conflict with the remake of Night of the Living Dead (1990). This mirrored Romero's experience on another Stephen King property, Pet Sematary (1989), which he was also slated to direct.  ", "\n    Some scenes (like the final battle), make liberal use of the color green. Stephen King has said that green is a color that, for him, represents death, unease, or the supernatural. It's also been used by King in other books, and by directors in movies based on his books. This is generally thought of as an influence from H.P. Lovecraft.  ", "\nJohn Ritter was a huge Stephen King fan.  ", "\nTim Curry has less than twenty minutes of screentime.  ", "\n    In the novel, two of the children have connections to other Stephen King characters. Mike Hanlon's father served in the Army with Dick Halloran, the cook from The Shining. Eddie Kaspbrak was also friends with young Paul Sheldon, who, as an adult, was the protagonist in Misery.  ", "\n    It was originally proposed that Tim Curry played all of the forms into which It shape shifts except the giant spider, but they decided it'd be quicker to have different actors and actresses playing those forms than to wait for Curry to have the make-up applied on him.  ", "\n    In the novel, the group is not referred to as \"The Lucky Seven\". They call themselves \"The Losers' Club\".  ", "\nDavid Alan Grier was considered for the role of Mike.  ", "\n    This mini-series came out in 1990, the same year that Bill Skarsgård was born. Skarsgård played Pennywise in It (2017) and It Chapter Two (2019).  ", "\n    Filmed in New Westminster, British Columbia in late 1989.  ", "\n    Young Richie Tozier (Seth Green) was menaced by a werewolf during this mini-series. Green played a werewolf on Buffy the Vampire Slayer (1997).  ", "\nTommy Lee Wallace wasn't sure about turning Audra from a heroine coming to rescue Bill into a victim who needs to be rescued by Bill. He didn't think it worked dramatically in this mini-series, or the novel for that matter.  ", "\n    The story spanned a thirty-year period, from 1960 to 1990.  ", "\nStephen King dubbed the rock-fight between the \"Lucky Seven\" and Henry Bowers the \"Apocalyptic Rock-Fight\" in the novel.  ", "\nJim Carrey was considered for Eddie Kaspbrak.  ", "\n    Although the members of The Losers' Club are all supposed to be the same age (forty-one), the actors and actress who played them as adults ranged widely in age. At the time of filming, the youngest, Dennis Christopher was thirty-four, Harry Anderson thirty-seven, Annette O'Toole thirty-eight, Richard Thomas thirty-nine, John Ritter and Richard Masur forty-one, and the oldest, Tim Reid, was forty-five.  ", "\n    This is Ben Heller's (young Stanley Uris') only mini-series.  ", "\n    The American punk rock band Pennywise took its name from the character.  ", "\n    Some of Brandon Crane's (Young Ben Hanscom's) anger at being bullied by Jarred Blancard (Henry Bowers) seemed very real to Writer and Director Tommy Lee Wallace.  ", "\nHarry Anderson (Richie Tozier) died on April 16, 2018, the same week Bill Hader entered talks to play Richie Tozier in It Chapter Two (2019).  ", "\nTim Curry is not in the last fifteen minutes of this mini-series.  ", "\nEmily Perkins admitted having a huge crush on Jonathan Brandis while shooting. According to her, Jonathan was \"really cute, and a very nice boy.\"  ", "\n    In the book, Beverly's husband Tom, who was her boyfriend in the movie, comes to Derry trying to track her down and find her.  ", "\nJonathan Brandis was on SeaQuest 2032 (1993), where Seth Green made a few guest appearances. Green's nickname was \"Wolfman\".  ", "\n    Writer and Director Tommy Lee Wallace likened \"The Lucky Seven\" to The Magnificent Seven (1960).  ", "\n    All 7 actors portraying the adult versions of \"The Losers' Club\" have either been nominated for or won either an Emmy or a Golden Globe.  ", "\n    Of the child actors, Jonathan Brandis had by far the most professional acting experience at the time and gave his co-stars advice.  ", "\n    In the novel, Bill Denbrough, Stanley Uris, Eddie Kaspbrak, and Beverly Marsh were all married adults. In this mini-series, only Bill and Stanley are married.  ", "\nRichard Masur only appeared in three scenes.  ", "\n    When each of the adults are introduced (with the exception of Michael and Stanley), a bottle of Dom Perignon is somehow interwoven within the scene.  ", "\n    \"IT\" was re-adapted in India as Woh (1998).  ", "\nSeth Green (Young Richie Tozier) and William B. Davis (Mr. Gedreau) appeared on The X-Files (1993).  ", "\n    Several media outlets, such as \"The Guardian\", have spoken of the character of \"Pennywise\", ranking it as one of the scariest clowns in film or pop culture. \"The Atlantic\" said of the character: \"the scariest thing about Pennywise, though, is how he preys on children's deepest fears, manifesting the monsters they're most petrified by (something J.K. Rowling emulated with boggarts).\" British scholar Mikita Brottman has also said of Pennywise: \"one of the most frightening of evil clowns to appear on the small screen\" and that it \"reflects every social and familial horror known to contemporary America.\" Critics such as Mark Dery have drawn connections between the character of Pennywise and serial killer John Wayne Gacy, who would dress up at community children's parties as \"Pogo the Clown\". Dery said that the character \"(embodied) our primal fears in a sociopathic Ronald McDonald who oozes honeyed guile.\" On his website, however, Stephen King makes no mention of Gacy in discussing his inspiration.  ", "\n    Although the kids in the Loser's Club were 12 years old in the flashbacks, only Emily Perkins was actually 12 during filming. Adam Faraizl was 11, Brandon Crane and Jonathan Brandis were 13, Marlon Taylor was 14, Seth Green was 15, and Ben Heller was 16. Jarred Blancard, who played the young Henry Bowers, is two days older than Heller.  ", "\nBrandon Crane and Ben Heller were both victims of bullying in their childhoods, so they could strongly relate to their characters. Crane was bullied for his weight and Heller was bullied for being small for his age.  ", "\nTim Curry appeared in The Hunt for Red October (1990), which also featured Stellan Skarsgård, whose son, Bill, played Pennywise in It (2017) and It Chapter Two (2019).  ", "\n    Pennywise has also been cited as a possible inspiration for two separate incidents of people dressing up as creepy clowns in Northampton, England and Staten Island, New York. In 2016, several reports of random appearances by \"evil clowns\" were reported by the media, including seven people in Alabama charged with \"clown-related activity\". Several newspaper reports cited the character of Pennywise as an influence for the outbreak, which led to Stephen King commenting that people should lower hysteria caused by the sightings and not take his work seriously. The first reported sighting of people dressed as evil clowns was in Greenville, South Carolina, where a small boy spoke to his mother of a pair of clowns that had attempted to lure him away. After such an incident, hundreds of clowns had since been spotted in various American states including Florida, New York, Wisconsin, Kentucky, and subsequently in other Western countries, from August 2016. By October 2016, in the wake of hundreds of \"clown sightings\" across the United States and Canada, the phenomenon had spread from North America to South America, Europe, Australia, and Asia. Some explanations for the 2016 clown sightings phenomenon hypothesized that at least some of the sightings are part of a viral marketing campaign, possibly for the Rob Zombie movie 31 (2016). Greenville Police Chief Ken Miller claimed to reporters that investigators are unsure as to whether the sightings have any connection with 31 (2016), whether it was one or more people looking for \"kicks\", or something more sinister. A spokesperson for New Line Cinema (distributor of the 2017 movie adaptation) released a statement claiming that \"New Line is absolutely not involved in the rash of clown sightings.\" Reacting to the comparison, Stephen King stated \"I suspect it's a kind of low-level hysteria, like Slender Man, or the so-called Bunny Man, who purportedly lurked in Fairfax County, Virginia, wearing a white hood with long ears and attacking people with a hatchet or an axe. The clown furor will pass, as these things do, but it will come back, because under the right circumstances, clowns really can be terrifying.\"  ", "\nThe Shining (1980) was Marlon Taylor's (young Mike Hanlon) favorite movie at the time which made him enthusiastic for this miniseries.  ", "\n    In the novel, Mike Hanlon gets stabbed by Henry Bowers in the library where he works.  ", "\nEmily Perkins based her portrayal of young Beverly on her mother, who had a troubled childhood and a rough upbringing; coincidentally, her mother's first name is also Beverly.  ", "\n    The sewer centrum was a set.  ", "\n    In Stephen King's novel, Audra Denbrough is supposed to greatly resemble Beverly Marsh. Interestingly, Olivia Hussey (Audra) and Annette O'Toole (Beverly Marsh) played sisters (although never in the same episode) in Boy Meets World (1993). Annette O'Toole played Topanga's Mother Rhiannon (Curtis) Lawrence and Olivia Hussey played Topanga's Aunt Prudence Curtis.  ", "\nChris Eastman appeared in The NeverEnding Story (1984), and Jonathan Brandis appeared in The NeverEnding Story II: The Next Chapter (1990).  ", "\n    Tim curry who played pennywise was afraid of clowns that he didnt want to himself in the mirror a makeup artist was almost fired for reveling his makeup  ", "\n    In the novel, Bill Denbrough has red hair and is going bald. However, in this mini-series, Denbrough (Richard Thomas) sports a full head of hair, including a long ponytail.  ", "\nHarry Anderson and Seth Green appeared on Tales from the Darkside (1983).  ", "\nJohn Ritter and Richard Thomas also worked together on The Waltons (1972).  ", "\n    Stan Uris and his wife were watching perfect strangers with Bronson Pinchot. Pinchot would later be on later Stephen King TV mini series The Langoliers (1995).  ", "\n    A spoof of the story titled \"IT Happens\" is the first segment in The Simpsons' Treehouse of Horror #23, the twenty-third and final issue of the Bart Simpson's Treehouse of Horror, a horror comedy anthology comic book series inspired by the eponymous yearly episodes on The Simpsons (1989). It was released on September 20th, 2017.  ", "\nTim Curry and John Ritter appeared in Over the Top (1997).  ", "\n    One of two 1990 productions in which John Ritter portrayed a character named \"Ben\". The other being Problem Child (1990).  ", "\n    Five of the adult leads were (and still are) famous from starring in iconic television shows. Tim Reid, WKRP in Cincinnati (1978); John Ritter, Three's Company (1976); Richard Thomas, The Waltons (1972); Harry Anderson, Night Court (1984); Michael Cole (older Henry Bowers), Mod Squad (1968) (and while Richard Masur was mostly a character-actor in films, he co-starred in the first season of One Day at a Time (1975)).  ", "\n    Tom Rogan has a much bigger part in the novel. He chases Beverly to Derry where Pennywise tries to get him to kill \"The Lucky Seven\". He eventually dies from shock after seeing the Deadlights.  ", "\n    In the novel, the flashbacks take place in the summer of 1958, and the Loser's Club reunites as adults in 1985. It is established in the book that IT emerges and feeds every 27 years. In the miniseries, the timeline was updated to 1960 for the flashbacks and 1990 for the reunion, and the timeline of IT coming back to terrorize Derry was changed to every 30 years.  "]